In [2]:
import pandas as pd

## Problem 1

In [3]:
# prob1
# ...
titanic = pd.read_csv('./titanic_train.csv')
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
len(titanic[(titanic['Sex']=='female') & (titanic['Survived']==1)])

233

In [5]:
len(titanic[(titanic['Sex']=='female')])

314

- Survived = 생존 여부
- Pclass = 티켓의 등급
- Sex = 성별
- Age = 나이
- Sibsp = 동승한 형제 자매 / 배우자 수
- Parch = 동승한 부모 / 자식 수
- Fare = 요금
- Embarked = 승선항

## Problem 2

`titanic_count` 변수와 `titanic_dim`  변수에 각각 titanic dataset의 행의 개수와 열의 개수를
 저장

In [6]:
# prob 2
titanic_count = titanic.shape[0]
titanic_dim = titanic.shape[1]
print(titanic_count)
print(titanic_dim)

891
12

## Problem 3

`titanic_fsurv` 변수와 `titanic_age_msurv` 변수에 각각 여성(female)과 남성(male)의 평균 연령(Age)을 계산해 저장해보세요.

(힌트: 판다스의 데이터프레임에 `.mean()` 함수를 호출하면 평균을 계산할 수 있습니다)

> 어떤 성별의 평균 연령이 더 작은가요?

In [17]:
# sol 3
titanic_fsurv = titanic[titanic['Sex']=='female']['Age'].mean().round(1)
titanic_msurv = titanic[titanic['Sex']=='male']['Age'].mean()

print('mean of survived female age = ', titanic_fsurv)
print('mean of survived male age = ', titanic_msurv)

mean of survived female age =  27.9
mean of survived male age =  30.72664459161148